######################### ZADANIE1 ################################################
# duration = int(input(" введи количество секунд: ")) #int - текст в число input - ввод текста
# print(duration) #print - печатать
# s = duration % 60 # % - остаток от деления
# m = duration // 60 % 60 # // - деление целочисленное
# h = duration // 60 // 60 % 24
# day = duration // 60 // 60 // 24
# print(f"количество дней {day} количество часов {h} количество минут {m} и секунд {s}")

######################### ZADANIE2 ################################################
# i = 1
# spisok = []
# while i < 1000:
#     i = i + 2
#     cub = i * i * i
#     # cub += 17 # раскоментить для прибовления 17 к кубу
#
#
#     a1 = cub % 10
#     a2 = cub // 10 % 10
#     a3 = cub // 10 // 10 % 10
#     a4 = cub // 10 // 10 // 10 % 10
#     a5 = cub // 10 // 10 // 10 // 10 % 10
#     a6 = cub // 10 // 10 // 10 // 10 // 10 % 10
#     a7 = cub // 10 // 10 // 10 // 10 // 10 // 10 % 10
#     a8 = cub // 10 // 10 // 10 // 10 // 10 // 10 // 10 % 10
#     a9 = cub // 10 // 10 // 10 // 10 // 10 // 10 // 10 // 10 % 10
#     b = a1 + a2 + a3 + a4 + a5 + a6 + a7 + a8 + a9
#     if b % 7 ==0:
#         spisok.append(b)
# print(spisok)

######################### ZADANIE3 ################################################
# n = input("Введите число ")
# n = int(n)
# a1 = n % 10
# a2 = n // 10 % 10
# name = "Процент"
# if a1 == 1:
#     ful_name = f"{n} {name}"
# elif a1 == 0:
#     ful_name = f"{n} {name}ов"
# elif a1 <=4:
#     ful_name = f"{n} {name}а"
# elif a1 <=10:
#     ful_name = f"{n} {name}ов"
#
# if a2 == 1:
#     ful_name = f"{n} {name}ов"
#
#
# print(ful_name)
